
## Plan Result (aat)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.s2s-secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.s2s-secret will be created
  + resource "azurerm_key_vault_secret" "s2s-secret" {
      + content_type            = "terraform-managed"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/sptribs-aat/providers/Microsoft.KeyVault/vaults/sptribs-aat"
      + name                    = "s2s-secret-sptribs-dss-update-case-web"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "special-tribunals"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sptribs-dss-update-case-web.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#special-tribunals-dev-channel"
          + "environment"         = "staging"
          + "managedBy"           = "Special Tribunals"
          + "source"              = "vault s2s-aat"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":148,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->